import React from 'react';
import './HomePage.css';
import '../common/image/ImagesRow.css';
import website_logo from "../pictures/website_logo.png";
import bibi_vs_lapid from "../pictures/politics/bibivslapid.png";
import elections from "../pictures/politics/elections.png"
import lapid_saar from "../pictures/politics/lapidsaar.png"
import bennett from "../pictures/politics/bennett.png"
import ImagesRow from "../common/image/ImagesRow";
import MenuHeader, {HomeHeader} from "../common/MenuHeader";

function PoliticsPage() {
    return (
        <div className="Home">
            <header className="Home-header">
                <br/>
                <HomeHeader/>
                <br/>
                <img src={website_logo} alt="website logo" height={100} width={150}/>
                <br/>
                <MenuHeader/>

                <h1> - POLITICS -  </h1>

                <h1> המפלגות הבזבזניות ביותר: תקווה חדשה ויש עתיד </h1>
                <p>
                    גם במערכת הבחירות הרביעית בתוך שנתיים, מרבית המפלגות השקיעו סכומים גבוהים במיוחד בפרסום,
                    שיווק ותעמולה בשורה של אמצעי תקשורת ודיגיטל. קבוצת יפעת מפרסמת את הנתונים,
                    שמהם עולה תמונה מפתיעה במיוחד: הליכוד, המפלגה הגדולה בישראל על פי כל הסקרים, השקיעה
                    כ-269 אלף שקלים בפרסום ברשתות החברתיות, באתרי החדשות ובעיתונות הכתובה.
                    זאת, כשהמפלגה הבזבזנית ביותר בתחום זה היא תקווה חדשה של גדעון סער – שהוציאה כ-3.4 מיליון שקלים
                </p>
                <ImagesRow images={
                    [{src: elections, name: "elections", height: 200, width: 420},
                        {src: lapid_saar, name: "lapid and sa'ar", height: 200, width: 420}]
                }/>

                <p>
                    "עולה כאן נתון תקדימי – הליכוד משקיע השקעה נמוכה ממרבית המפלגות בקניית שטחי פרסום", אמר מני אברהמי,
                    מנכ"ל קבוצת יפעת. "הם מנהלים קמפיין זול ויעיל, נתניהו כפרזנטור מייצר סדר ומתראיין
                    ללא הרף, ומוכיח שניתן לנהל קמפיין טוב ללא השקעה מסיבית בקניית שטחי פרסום
                </p>
                <br/>
                <h1> ביבי vs לפיד </h1>
                <p>
                    יומיים בלבד לפני הבחירות, יו"ר יש עתיד יאיר לפיד הגיע היום (ראשון) לריאיון מיוחד
                    אצל עודד בן עמי. בריאיון התייחס לפיד לסירובו של ראש הממשלה נתניהו להתייצב לעימות מולו וטען
                    כי "נתניהו איש יצירתי, הוא היה יכול למצוא תירוצים יותר יצרתיים לסיבה שהוא לא
                    רוצה להיפגש לעימות איתי". "מה שמוביל אותי לפה זה שילוב של דאגה ותקווה",
                    השיב יו"ר יש עתיד על השאלה מדוע אינו מכריז שהוא מתמודד לראשות הממשלה.
                    על בחירתו של נתניהו שלא להגיע לעימות בשידור חי בחדשות 12 אמר לפיד: "נתניהו פוחד
                    מהעובדות. יש יותר מ-6,000 מתים, מדובר בממשלה של סחטנים וגזענים שתיקח כסף
                    מאנשים שעובדים ותיתן אותו לאנשים שלא עובדים". לפיד טען כי אינו מצהיר שהוא מתמודד לראשות הממשלה
                    מכיוון שלהרגשתו הפוליטיקה הישראלית הפכה לתוכנית ריאליטי
                </p>
                <img src={bibi_vs_lapid} alt="Bibi vs Lapid" height={300} width={500}/>
                <br/>
                <h1>נפתלי בנט לא ישב בממשלה בראשות יו"ר יש עתיד</h1>
                <p>
                    עוד התחייב בנט כי לא יקים ממשלה המתבססת על קולותיו של יו"ר רע"מ מנסור עבאס.
                    בתחתית המסמך נותרה שורת חתימה ריקה המיועדת לראש הממשלה בנימין נתניהו.
                </p>
                <img src={bennett} alt="Bennett" height={300} width={500}/>
                <p>
                    יו"ר מפלגת ימינה, נפתלי בנט, חתם היום (ראשון) על מסמך במהלך ריאיון
                    בערוץ 20, ובו התחייב בין היתר כי לא יישב בממשלה בראשותו של יאיר לפיד.
                    "לא אאפשר ליאיר לפיד להיות ראש ממשלה, גם לא ברוטציה. לא אקים
                    ממשלה על קולותיו של מנצור עבאס מהתנועה האסלאמית", אלו שני הסעיפים עליהם חתם בנט במהלך הריאיון.
                    "אנחנו לא נשב בממשלה בראשות השמאל", הוסיף בנט, "אין לנו בעיה שלפיד ישתתף בממשלה והברירה בקלפי
                    בסוף זה או המשך הדשדוש עם נתניהו, או שינוי וזינוק בהובלה שלי". באשר לטענה של לפיד
                    כי הוא אינו איש שמאל, אמר יו"ר ימינה: "הוא גם יכול להגיד שהוא קנגורו
                </p>

            </header>
        </div>
    );
}

export default PoliticsPage;