import React from 'react';
import './HomePage.css';
import '../common/image/ImagesRow.css';
import website_logo from "../pictures/website_logo.png";
import deni1 from "../pictures/sports/deni1.png"
import deni2 from "../pictures/sports/deni2.jpg"
import deni3 from "../pictures/sports/deni3.jpeg"
import football from "../pictures/sports/football.png"
import ImagesRow from "../common/image/ImagesRow";
import MenuHeader, {HomeHeader} from "../common/MenuHeader";

function SportsPage() {
    return (
        <div className="Home">
            <header className="Home-header">
                <br/>
                <HomeHeader/>
                <br/>
                <img src={website_logo} alt="website logo" height={100} width={150}/>
                <br/>
                <MenuHeader/>

                <h1> - SPORTS -  </h1>

                <h1> "אבדיה הוא נכס. וושינגטון לא תוותר עליו" </h1>
                <p>
                    דני אבדיה יפגוש הלילה את ברוקלין נטס, אבל הפנים של קבוצתו הם לקראת נעילת הטרייד דד
                    ליין ביום חמישי. העיתונאים שמסקרים את וושינגטון ניסו לנתח את הצעדים הבאים של הוויזארדס,
                    וכן, הזכירו גם את דני אבדיה. "הוויזארדס דנים באפשרות של עזיבה של טרוי בראון ג'וניור ומו ואגנר",
                    העיתונאי קווינטון מאיו דיווח, "יש לקבוצה נכסים כמו רוי האצ'ימורה ודני אבדיה
                    שהיו יכולים לעזור לוויזארדס להשיג בטרייד את השחקן שהם צריכים,
                    אבל עזיבה שלהם זה משהו שלא עומד על הפרק כי רואים בהם שחקני העתיד של הפרנצ'ייז".
                </p>
                <ImagesRow images={
                    [{src: deni1, name: "deni", height: 200, width: 420},
                        {src: deni2, name: "deni", height: 200, width: 420}]
                }/>

                <p>
                    "לאחרונה השם שלו הפך להיות אקטואלי, אבל בגלל העונה הרעה שעוברת עליו והחוזה הגבוה שלו,
                    כרגע אין מועמדות לקלוט אותו. בראדלי ביל? יישאר בוודאות, לא שוקלים אפילו שיעזוב".
                    בסיום, העיתונאי העריך שייתכן שוושינגטון כלל לא תבצע שינויים בסגל: "וושינגטון מאוד לא יציבה וזה גורם
                    לתסכול אצל ה-GM טומי שפרד והמאמן סקוט ברוקס. יש מעט מאוד שחקנים
                    שמעניינים את ראשי הפרנצ'ייז, כך שייתכן שלא יהיה שום שינוי עד יום חמישי".
                </p>
                <img src={deni3} alt="Deni" height={100} width={150}/>

                <br/>
                <h1> מכבי ת"א וכפ"ס ניצחו ברבע גמר הפלייאוף </h1>
                <p>
                    פיינליסטיות הגביע גברו על ב"ש ועיילבון בתוצאה 0:3
                </p>
                <img src={football} alt="Football" height={300} width={500}/>
                <p>
                    שלושה ימים אחרי גמר גביע המדינה לגברים, הערב (ראשון) ניצחו שתי המתמודדות באותו גמר במשחק
                    הראשון של רבע גמר פלייאוף. מכבי תל אביב ניצחה את אסא בן גוריון באר שבע
                    ואילו הפועל כפר סבא ניצחה את מ.ס עיילבון.
                    מחזיקת הגביע הטריה מכבי תל אביב המשיכה את התקופה הנהדרת שלה ולמרות שתי מערכות ראשונות
                    בהן באר שבע דיגדגה את המדורגת ראשונה בסיום העונה, מכבי ידעה לצאת מזה בקלות ולנצח במערכה
                    השלישית ובמשחק כולו.
                    הפועל כפר סבא התאוששה מהר מההפסד בגמר הגביע וניצחה בשחזור מדויק של חצי גמר הגביע מהשבוע
                    שעבר את מ.ס עיילבון במשחק הראשון של רבע גמר הפלייאוף
                </p>

            </header>
        </div>
    );
}

export default SportsPage;